In [4]:
import pandas as pd

In [5]:
titanic_train = pd.read_csv('train.csv')

In [6]:
pd.DataFrame(titanic_train)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [7]:
titanic_train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [8]:
titanic_train.tail(10)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
881          882         0       3  ...   7.8958   NaN         S
882          883         0       3  ...  10.5167   NaN         S
883          884         0       2  ...  10.5000   NaN         S
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[10 rows x 12 columns]

In [9]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [10]:
titanic_train.describe() #only for numerical data

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [11]:
titanic_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [12]:
#Categorical features
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [13]:
titanic_train.dtypes[titanic_train.dtypes=='object']

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [14]:
#Filtering object data's
titanic_train[titanic_train.dtypes[titanic_train.dtypes=='object'].index]

                                                  Name     Sex  ... Cabin Embarked
0                              Braund, Mr. Owen Harris    male  ...   NaN        S
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  ...   C85        C
2                               Heikkinen, Miss. Laina  female  ...   NaN        S
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  ...  C123        S
4                             Allen, Mr. William Henry    male  ...   NaN        S
..                                                 ...     ...  ...   ...      ...
886                              Montvila, Rev. Juozas    male  ...   NaN        S
887                       Graham, Miss. Margaret Edith  female  ...   B42        S
888           Johnston, Miss. Catherine Helen "Carrie"  female  ...   NaN        S
889                              Behr, Mr. Karl Howell    male  ...  C148        C
890                                Dooley, Mr. Patrick    male  ...   NaN        Q

[891 rows x 5 columns]

In [15]:
titanic_train_1 = titanic_train[titanic_train.dtypes[titanic_train.dtypes=='object'].index]

In [16]:
titanic_train_1.describe()

                   Name   Sex    Ticket Cabin Embarked
count               891   891       891   204      889
unique              891     2       681   147        3
top     Cacic, Mr. Luka  male  CA. 2343    G6        S
freq                  1   577         7     4      644

In [17]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [18]:
type(titanic_train['Pclass'])

pandas.core.series.Series

In [19]:
titanic_train['Pclass'][5:0:-1]

5    3
4    3
3    1
2    3
1    1
Name: Pclass, dtype: int64

In [20]:
titanic_train[['Survived','Embarked']]

     Survived Embarked
0           0        S
1           1        C
2           1        S
3           1        S
4           0        S
..        ...      ...
886         0        S
887         1        S
888         0        S
889         1        C
890         0        Q

[891 rows x 2 columns]

In [21]:
titanic_train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [22]:
#New Column
titanic_train['new_column']='vishnu'

In [23]:
titanic_train

     PassengerId  Survived  Pclass  ... Cabin Embarked  new_column
0              1         0       3  ...   NaN        S      vishnu
1              2         1       1  ...   C85        C      vishnu
2              3         1       3  ...   NaN        S      vishnu
3              4         1       1  ...  C123        S      vishnu
4              5         0       3  ...   NaN        S      vishnu
..           ...       ...     ...  ...   ...      ...         ...
886          887         0       2  ...   NaN        S      vishnu
887          888         1       1  ...   B42        S      vishnu
888          889         0       3  ...   NaN        S      vishnu
889          890         1       1  ...  C148        C      vishnu
890          891         0       3  ...   NaN        Q      vishnu

[891 rows x 13 columns]

In [24]:
pd.Categorical(titanic_train['Pclass']) #3 categories = 1,2,3

[3, 1, 3, 1, 3, ..., 2, 1, 3, 1, 3]
Length: 891
Categories (3, int64): [1, 2, 3]

In [25]:
pd.Categorical(titanic_train['Survived'])

[0, 1, 1, 1, 0, ..., 0, 1, 0, 1, 0]
Length: 891
Categories (2, int64): [0, 1]

In [26]:
pd.Categorical(titanic_train['Age'])

[22.0, 38.0, 26.0, 35.0, 35.0, ..., 27.0, 19.0, NaN, 26.0, 32.0]
Length: 891
Categories (88, float64): [0.42, 0.67, 0.75, 0.83, ..., 70.5, 71.0, 74.0, 80.0]

In [27]:
pd.Categorical(titanic_train['PassengerId'])

[1, 2, 3, 4, 5, ..., 887, 888, 889, 890, 891]
Length: 891
Categories (891, int64): [1, 2, 3, 4, ..., 888, 889, 890, 891]

In [28]:
pd.Categorical(titanic_train['Cabin'])

[NaN, 'C85', NaN, 'C123', NaN, ..., NaN, 'B42', NaN, 'C148', NaN]
Length: 891
Categories (147, object): ['A10', 'A14', 'A16', 'A19', ..., 'F38', 'F4', 'G6', 'T']

In [29]:
#null values
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
new_column      object
dtype: object

In [30]:
titanic_train['Age'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [31]:
titanic_train['Age'].isnull().sum()

177

In [32]:
titanic_train[titanic_train['Age'].isnull()==True]

     PassengerId  Survived  Pclass  ... Cabin Embarked  new_column
5              6         0       3  ...   NaN        Q      vishnu
17            18         1       2  ...   NaN        S      vishnu
19            20         1       3  ...   NaN        C      vishnu
26            27         0       3  ...   NaN        C      vishnu
28            29         1       3  ...   NaN        Q      vishnu
..           ...       ...     ...  ...   ...      ...         ...
859          860         0       3  ...   NaN        C      vishnu
863          864         0       3  ...   NaN        S      vishnu
868          869         0       3  ...   NaN        S      vishnu
878          879         0       3  ...   NaN        S      vishnu
888          889         0       3  ...   NaN        S      vishnu

[177 rows x 13 columns]

In [33]:
#getting indexes of the null values
import numpy as np
np.where(titanic_train['Age'].isnull()==True)

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154, 158, 159, 166, 168, 176, 180, 181, 185, 186,
        196, 198, 201, 214, 223, 229, 235, 240, 241, 250, 256, 260, 264,
        270, 274, 277, 284, 295, 298, 300, 301, 303, 304, 306, 324, 330,
        334, 335, 347, 351, 354, 358, 359, 364, 367, 368, 375, 384, 388,
        409, 410, 411, 413, 415, 420, 425, 428, 431, 444, 451, 454, 457,
        459, 464, 466, 468, 470, 475, 481, 485, 490, 495, 497, 502, 507,
        511, 517, 522, 524, 527, 531, 533, 538, 547, 552, 557, 560, 563,
        564, 568, 573, 578, 584, 589, 593, 596, 598, 601, 602, 611, 612,
        613, 629, 633, 639, 643, 648, 650, 653, 656, 667, 669, 674, 680,
        692, 697, 709, 711, 718, 727, 732, 738, 739, 740, 760, 766, 768,
        773, 776, 778, 783, 790, 792, 793, 815, 825, 826, 828, 832, 837,
        839, 846, 849, 859, 863, 868, 878, 888]),)

In [34]:
titanic_train['Age'][17]

nan

In [35]:
#In which record, there is maximum fare collected
np.where(titanic_train['Fare']==max(titanic_train['Fare']))

(array([258, 679, 737]),)

In [36]:
#data only for male
np.where(titanic_train['Sex']=='male')

(array([  0,   4,   5,   6,   7,  12,  13,  16,  17,  20,  21,  23,  26,
         27,  29,  30,  33,  34,  35,  36,  37,  42,  45,  46,  48,  50,
         51,  54,  55,  57,  59,  60,  62,  63,  64,  65,  67,  69,  70,
         72,  73,  74,  75,  76,  77,  78,  80,  81,  83,  86,  87,  89,
         90,  91,  92,  93,  94,  95,  96,  97,  99, 101, 102, 103, 104,
        105, 107, 108, 110, 112, 115, 116, 117, 118, 120, 121, 122, 124,
        125, 126, 127, 129, 130, 131, 134, 135, 137, 138, 139, 143, 144,
        145, 146, 148, 149, 150, 152, 153, 154, 155, 157, 158, 159, 160,
        162, 163, 164, 165, 168, 169, 170, 171, 173, 174, 175, 176, 178,
        179, 181, 182, 183, 185, 187, 188, 189, 191, 193, 196, 197, 200,
        201, 202, 203, 204, 206, 207, 209, 210, 212, 213, 214, 217, 219,
        220, 221, 222, 223, 224, 225, 226, 227, 228, 231, 232, 234, 236,
        238, 239, 242, 243, 244, 245, 248, 249, 250, 252, 253, 260, 261,
        262, 263, 265, 266, 267, 270, 271, 273, 277, 278, 280, 281, 282,
        283, 284, 285, 286, 287, 288, 292, 294, 295, 296, 298, 301, 302,
        304, 305, 308, 313, 314, 317, 320, 321, 324, 326, 331, 332, 333,
        335, 336, 338, 339, 340, 342, 343, 344, 348, 349, 350, 351, 352,
        353, 354, 355, 360, 361, 363, 364, 365, 370, 371, 372, 373, 377,
        378, 379, 382, 384, 385, 386, 388, 390, 391, 392, 395, 397, 398,
        400, 401, 403, 405, 406, 407, 408, 410, 411, 413, 414, 418, 420,
        421, 422, 424, 425, 428, 429, 430, 433, 434, 438, 439, 441, 442,
        444, 445, 447, 449, 450, 451, 452, 453, 454, 455, 456, 459, 460,
        461, 462, 463, 464, 465, 466, 467, 468, 470, 471, 475, 476, 477,
        478, 480, 481, 482, 484, 487, 488, 489, 490, 491, 492, 493, 494,
        495, 497, 499, 500, 505, 507, 508, 509, 510, 511, 512, 514, 515,
        517, 519, 521, 522, 524, 525, 527, 528, 529, 531, 532, 536, 538,
        543, 544, 545, 547, 548, 549, 550, 551, 552, 553, 555, 557, 560,
        561, 562, 563, 565, 566, 568, 569, 570, 572, 574, 575, 579, 582,
        583, 584, 586, 587, 588, 589, 590, 592, 594, 595, 597, 598, 599,
        601, 602, 603, 604, 605, 606, 607, 611, 613, 614, 616, 619, 620,
        621, 622, 623, 624, 625, 626, 628, 629, 630, 631, 632, 633, 636,
        637, 639, 640, 643, 645, 646, 647, 648, 650, 652, 655, 656, 658,
        659, 660, 661, 662, 663, 664, 665, 666, 667, 668, 671, 672, 673,
        674, 675, 676, 679, 681, 682, 683, 684, 685, 686, 687, 688, 690,
        692, 693, 694, 695, 696, 698, 699, 701, 703, 704, 705, 707, 709,
        711, 712, 713, 714, 715, 718, 719, 721, 722, 723, 724, 725, 728,
        731, 732, 733, 734, 735, 737, 738, 739, 740, 741, 743, 744, 745,
        746, 748, 749, 751, 752, 753, 755, 756, 757, 758, 760, 761, 762,
        764, 766, 768, 769, 770, 771, 773, 775, 776, 778, 782, 783, 784,
        785, 787, 788, 789, 790, 791, 793, 794, 795, 798, 800, 802, 803,
        804, 805, 806, 808, 810, 811, 812, 814, 815, 817, 818, 819, 821,
        822, 824, 825, 826, 827, 828, 831, 832, 833, 834, 836, 837, 838,
        839, 840, 841, 843, 844, 845, 846, 847, 848, 850, 851, 857, 859,
        860, 861, 864, 867, 868, 869, 870, 872, 873, 876, 877, 878, 881,
        883, 884, 886, 889, 890]),)

In [37]:
#column extraction
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'new_column'],
      dtype='object')

In [38]:
#row extraction
titanic_train.iloc[1:5]  #[row range]

   PassengerId  Survived  Pclass  ... Cabin Embarked  new_column
1            2         1       1  ...   C85        C      vishnu
2            3         1       3  ...   NaN        S      vishnu
3            4         1       1  ...  C123        S      vishnu
4            5         0       3  ...   NaN        S      vishnu

[4 rows x 13 columns]

In [39]:
titanic_train.iloc[[1,3,4,5]]  #[[rows needed]]

   PassengerId  Survived  Pclass  ... Cabin Embarked  new_column
1            2         1       1  ...   C85        C      vishnu
3            4         1       1  ...  C123        S      vishnu
4            5         0       3  ...   NaN        S      vishnu
5            6         0       3  ...   NaN        Q      vishnu

[4 rows x 13 columns]

In [40]:
#name of the person spend maximum fare
(titanic_train.iloc[np.where(titanic_train['Fare']==max(titanic_train['Fare']))])['Name']

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

In [41]:
#All the survived people name
(titanic_train.iloc[np.where(titanic_train["Survived"]==1)])['Name']

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
8      Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                    Nasser, Mrs. Nicholas (Adele Achem)
                             ...
875                     Najib, Miss. Adele Kiamie "Jane"
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880         Shelley, Mrs. William (Imanita Parrish Hall)
887                         Graham, Miss. Margaret Edith
889                                Behr, Mr. Karl Howell
Name: Name, Length: 342, dtype: object

In [42]:
#All the survived people count
(titanic_train.iloc[np.where(titanic_train["Survived"]==1)])['Name'].count()

342

In [43]:
#dummy data
labels =['a','b','c','d']
list_1 = [12,45,67]
array = np.array(list_1)
d = {'a': 34,'b':30,'c':23}

In [44]:
#converting list into series
pd.Series(list_1)

0    12
1    45
2    67
dtype: int64

In [45]:
#custom indexes
pd.Series(list_1,index=["vis",'hnu','var'])

vis    12
hnu    45
var    67
dtype: int64

In [46]:
s1= pd.Series(list_1,index=["vis",'hnu','var'])

In [47]:
s1[0] #still we can use integer indexes even after changing it

12

In [48]:
s1[0:3]

vis    12
hnu    45
var    67
dtype: int64

In [49]:
s1['vis']

12

In [50]:
array

array([12, 45, 67])

In [51]:
pd.Series(array)

0    12
1    45
2    67
dtype: int64

In [52]:
d

{'a': 34, 'b': 30, 'c': 23}

In [53]:
s2 = pd.Series(d) #key will become indexes

In [54]:
s2[0] #even working with default indexes

34

In [55]:
#duplicate indexes in series
series1 = pd.Series([1,2,3,4,5],index=['a','b','c','c','e'])

In [56]:
series1['c'] #gives all occurances

c    3
c    4
dtype: int64

In [57]:
series1[3] #numerical index is unique

4

In [58]:
series2 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [59]:
series1 + series2 #index should be in both series to perform sum

a     2.0
b     4.0
c     6.0
c     7.0
d     NaN
e    10.0
dtype: float64

In [60]:
s3 = series1 * series2

In [61]:
s3.iloc[0] #cannot use named indexes in iloc

1.0

In [62]:
s3.loc['a']

1.0

In [63]:
s3['a']

1.0

In [64]:
rand= pd.DataFrame(np.random.randn(5,5),index=['a','b','c','d','e'],columns=['u','v','w','x','y'])
np.random.seed(42)

In [65]:
rand

          u         v         w         x         y
a -2.043638 -0.239392  0.534559 -0.279438 -0.157854
b -0.411209  0.265056 -1.805991  0.736419  1.988190
c -0.659077  0.175598  2.285992  0.457655  2.565459
d  1.407840  0.267278  0.418489  0.601408 -1.614601
e  0.165027 -1.521631 -0.758163 -1.060364  1.285560

In [66]:
rand.iloc[[0,3]]

          u         v         w         x         y
a -2.043638 -0.239392  0.534559 -0.279438 -0.157854
d  1.407840  0.267278  0.418489  0.601408 -1.614601

In [67]:
rand.iloc[0:3]

          u         v         w         x         y
a -2.043638 -0.239392  0.534559 -0.279438 -0.157854
b -0.411209  0.265056 -1.805991  0.736419  1.988190
c -0.659077  0.175598  2.285992  0.457655  2.565459

In [68]:
rand.iloc[3:0:-1]

          u         v         w         x         y
d  1.407840  0.267278  0.418489  0.601408 -1.614601
c -0.659077  0.175598  2.285992  0.457655  2.565459
b -0.411209  0.265056 -1.805991  0.736419  1.988190

In [69]:
rand.loc['a':'c']

          u         v         w         x         y
a -2.043638 -0.239392  0.534559 -0.279438 -0.157854
b -0.411209  0.265056 -1.805991  0.736419  1.988190
c -0.659077  0.175598  2.285992  0.457655  2.565459

In [70]:
rand.loc[['a','d']]

          u         v         w         x         y
a -2.043638 -0.239392  0.534559 -0.279438 -0.157854
d  1.407840  0.267278  0.418489  0.601408 -1.614601

In [71]:
rand['new_col'] = rand['x'] + rand['y']

In [72]:
rand['new_col1']=rand['x']*rand['y']

In [77]:
rand.drop('new_col1',axis=1,inplace=True)  #axis=0 => row, axis = 1 => column, (default is 0)

In [78]:
rand.head()

          u         v         w         x         y   new_col
a -2.043638 -0.239392  0.534559 -0.279438 -0.157854 -0.437291
b -0.411209  0.265056 -1.805991  0.736419  1.988190  2.724609
c -0.659077  0.175598  2.285992  0.457655  2.565459  3.023114
d  1.407840  0.267278  0.418489  0.601408 -1.614601 -1.013193
e  0.165027 -1.521631 -0.758163 -1.060364  1.285560  0.225196

In [79]:
rand.drop('new_col',axis=1,inplace=True)

In [80]:
rand.head()

          u         v         w         x         y
a -2.043638 -0.239392  0.534559 -0.279438 -0.157854
b -0.411209  0.265056 -1.805991  0.736419  1.988190
c -0.659077  0.175598  2.285992  0.457655  2.565459
d  1.407840  0.267278  0.418489  0.601408 -1.614601
e  0.165027 -1.521631 -0.758163 -1.060364  1.285560

In [81]:
#remove records where age is null
np.where(titanic_train['Age'].isnull()==True)

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154, 158, 159, 166, 168, 176, 180, 181, 185, 186,
        196, 198, 201, 214, 223, 229, 235, 240, 241, 250, 256, 260, 264,
        270, 274, 277, 284, 295, 298, 300, 301, 303, 304, 306, 324, 330,
        334, 335, 347, 351, 354, 358, 359, 364, 367, 368, 375, 384, 388,
        409, 410, 411, 413, 415, 420, 425, 428, 431, 444, 451, 454, 457,
        459, 464, 466, 468, 470, 475, 481, 485, 490, 495, 497, 502, 507,
        511, 517, 522, 524, 527, 531, 533, 538, 547, 552, 557, 560, 563,
        564, 568, 573, 578, 584, 589, 593, 596, 598, 601, 602, 611, 612,
        613, 629, 633, 639, 643, 648, 650, 653, 656, 667, 669, 674, 680,
        692, 697, 709, 711, 718, 727, 732, 738, 739, 740, 760, 766, 768,
        773, 776, 778, 783, 790, 792, 793, 815, 825, 826, 828, 832, 837,
        839, 846, 849, 859, 863, 868, 878, 888]),)

In [84]:
index =np.where(titanic_train['Age'].isnull()==True)
titanic_train.drop(index[0])  #1D

     PassengerId  Survived  Pclass  ... Cabin Embarked  new_column
0              1         0       3  ...   NaN        S      vishnu
1              2         1       1  ...   C85        C      vishnu
2              3         1       3  ...   NaN        S      vishnu
3              4         1       1  ...  C123        S      vishnu
4              5         0       3  ...   NaN        S      vishnu
..           ...       ...     ...  ...   ...      ...         ...
885          886         0       3  ...   NaN        Q      vishnu
886          887         0       2  ...   NaN        S      vishnu
887          888         1       1  ...   B42        S      vishnu
889          890         1       1  ...  C148        C      vishnu
890          891         0       3  ...   NaN        Q      vishnu

[714 rows x 13 columns]

In [85]:
rand.head()

          u         v         w         x         y
a -2.043638 -0.239392  0.534559 -0.279438 -0.157854
b -0.411209  0.265056 -1.805991  0.736419  1.988190
c -0.659077  0.175598  2.285992  0.457655  2.565459
d  1.407840  0.267278  0.418489  0.601408 -1.614601
e  0.165027 -1.521631 -0.758163 -1.060364  1.285560

In [89]:
#getting a subset value
rand.iloc[[0,1],[3,4]]  #[[rows][columns]]

          x         y
a -0.279438 -0.157854
b  0.736419  1.988190

In [88]:
rand.loc[['a','b'],['x','y']]

          x         y
a -0.279438 -0.157854
b  0.736419  1.988190

In [91]:
rand.iloc[0:2,4:] #row range, column range

          y
a -0.157854
b  1.988190

In [92]:
rand>0

       u      v      w      x      y
a  False  False   True  False  False
b  False   True  False   True   True
c  False   True   True   True   True
d   True   True   True   True  False
e   True  False  False  False   True

In [93]:
rand[rand>0]

          u         v         w         x         y
a       NaN       NaN  0.534559       NaN       NaN
b       NaN  0.265056       NaN  0.736419  1.988190
c       NaN  0.175598  2.285992  0.457655  2.565459
d  1.407840  0.267278  0.418489  0.601408       NaN
e  0.165027       NaN       NaN       NaN  1.285560

In [95]:
rand['y']<0

a     True
b    False
c    False
d     True
e    False
Name: y, dtype: bool

In [96]:
rand[rand['y']<0]

          u         v         w         x         y
a -2.043638 -0.239392  0.534559 -0.279438 -0.157854
d  1.407840  0.267278  0.418489  0.601408 -1.614601

In [98]:
rand[(rand['y']<0) & (rand['v']<0)]

          u         v         w         x         y
a -2.043638 -0.239392  0.534559 -0.279438 -0.157854

In [100]:
rand.reset_index() #default indexes

  index         u         v         w         x         y
0     a -2.043638 -0.239392  0.534559 -0.279438 -0.157854
1     b -0.411209  0.265056 -1.805991  0.736419  1.988190
2     c -0.659077  0.175598  2.285992  0.457655  2.565459
3     d  1.407840  0.267278  0.418489  0.601408 -1.614601
4     e  0.165027 -1.521631 -0.758163 -1.060364  1.285560

In [101]:
rand.set_index('u') #setting a column as a index

                  v         w         x         y
u
-2.043638 -0.239392  0.534559 -0.279438 -0.157854
-0.411209  0.265056 -1.805991  0.736419  1.988190
-0.659077  0.175598  2.285992  0.457655  2.565459
 1.407840  0.267278  0.418489  0.601408 -1.614601
 0.165027 -1.521631 -0.758163 -1.060364  1.285560

In [102]:
# New Dataframe
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df['States']='CA NV AZ'.split()
df.set_index('States',inplace=True)
print(df)

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

In [104]:
df.dropna() #drops the records with null values

          A    B  C
States
CA      1.0  5.0  1

In [106]:
df.dropna(axis=0) #axis=rows

          A    B  C
States
CA      1.0  5.0  1

In [107]:
df.dropna(axis=1)

        C
States
CA      1
NV      2
AZ      3

In [109]:
df.dropna(axis=0, thresh=1) #threshold = require that many non-na value(atleast one non-na value in our case)

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

In [110]:
df.dropna(axis=0,thresh=2)

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2

In [111]:
df.fillna(value='vishnu')

             A       B  C
States
CA           1       5  1
NV           2  vishnu  2
AZ      vishnu  vishnu  3

In [112]:
df.fillna(value=df['A'].mean())

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  1.5  2
AZ      1.5  1.5  3

In [114]:
df.fillna(value=6)

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  6.0  2
AZ      6.0  6.0  3

In [115]:
titanic_train.head()

   PassengerId  Survived  Pclass  ... Cabin Embarked  new_column
0            1         0       3  ...   NaN        S      vishnu
1            2         1       1  ...   C85        C      vishnu
2            3         1       3  ...   NaN        S      vishnu
3            4         1       1  ...  C123        S      vishnu
4            5         0       3  ...   NaN        S      vishnu

[5 rows x 13 columns]

In [116]:
titanic_train.dropna(axis=1)

     PassengerId  Survived  Pclass  ...            Ticket     Fare  new_column
0              1         0       3  ...         A/5 21171   7.2500      vishnu
1              2         1       1  ...          PC 17599  71.2833      vishnu
2              3         1       3  ...  STON/O2. 3101282   7.9250      vishnu
3              4         1       1  ...            113803  53.1000      vishnu
4              5         0       3  ...            373450   8.0500      vishnu
..           ...       ...     ...  ...               ...      ...         ...
886          887         0       2  ...            211536  13.0000      vishnu
887          888         1       1  ...            112053  30.0000      vishnu
888          889         0       3  ...        W./C. 6607  23.4500      vishnu
889          890         1       1  ...            111369  30.0000      vishnu
890          891         0       3  ...            370376   7.7500      vishnu

[891 rows x 10 columns]

In [119]:
df1 = titanic_train.dropna(axis=1)

In [121]:
df1.head()

   PassengerId  Survived  Pclass  ...            Ticket     Fare  new_column
0            1         0       3  ...         A/5 21171   7.2500      vishnu
1            2         1       1  ...          PC 17599  71.2833      vishnu
2            3         1       3  ...  STON/O2. 3101282   7.9250      vishnu
3            4         1       1  ...            113803  53.1000      vishnu
4            5         0       3  ...            373450   8.0500      vishnu

[5 rows x 10 columns]

In [127]:
g = df1.groupby('Sex') #creating a groupby object

In [128]:
g.mean()

        PassengerId  Survived    Pclass     SibSp     Parch       Fare
Sex
female   431.028662  0.742038  2.159236  0.694268  0.649682  44.479818
male     454.147314  0.188908  2.389948  0.429809  0.235702  25.523893

In [130]:
g.sum()[['Survived','Fare']]

        Survived        Fare
Sex
female       233  13966.6628
male         109  14727.2865

In [132]:
new_group = g.sum()

In [133]:
new_group.loc['female']

PassengerId    135343.0000
Survived          233.0000
Pclass            678.0000
SibSp             218.0000
Parch             204.0000
Fare            13966.6628
Name: female, dtype: float64

In [134]:
new_group.loc['male']

PassengerId    262043.0000
Survived          109.0000
Pclass           1379.0000
SibSp             248.0000
Parch             136.0000
Fare            14727.2865
Name: male, dtype: float64

In [136]:
new_group

        PassengerId  Survived  Pclass  SibSp  Parch        Fare
Sex
female       135343       233     678    218    204  13966.6628
male         262043       109    1379    248    136  14727.2865

In [135]:
new_group.transpose()

Sex               female         male
PassengerId  135343.0000  262043.0000
Survived        233.0000     109.0000
Pclass          678.0000    1379.0000
SibSp           218.0000     248.0000
Parch           204.0000     136.0000
Fare          13966.6628   14727.2865

In [138]:
df1

     PassengerId  Survived  Pclass  ...            Ticket     Fare  new_column
0              1         0       3  ...         A/5 21171   7.2500      vishnu
1              2         1       1  ...          PC 17599  71.2833      vishnu
2              3         1       3  ...  STON/O2. 3101282   7.9250      vishnu
3              4         1       1  ...            113803  53.1000      vishnu
4              5         0       3  ...            373450   8.0500      vishnu
..           ...       ...     ...  ...               ...      ...         ...
886          887         0       2  ...            211536  13.0000      vishnu
887          888         1       1  ...            112053  30.0000      vishnu
888          889         0       3  ...        W./C. 6607  23.4500      vishnu
889          890         1       1  ...            111369  30.0000      vishnu
890          891         0       3  ...            370376   7.7500      vishnu

[891 rows x 10 columns]

In [140]:
#for simplicity
newdf = df1.iloc[0:5,0:5]

In [141]:
df1 = newdf

In [142]:
df2 = newdf

In [143]:
df3 = newdf

In [145]:
#concatenate
pd.concat([df1,df2,df3]) #axis = 0 by default

   PassengerId  ...     Sex
0            1  ...    male
1            2  ...  female
2            3  ...  female
3            4  ...  female
4            5  ...    male
0            1  ...    male
1            2  ...  female
2            3  ...  female
3            4  ...  female
4            5  ...    male
0            1  ...    male
1            2  ...  female
2            3  ...  female
3            4  ...  female
4            5  ...    male

[15 rows x 5 columns]

In [146]:
pd.concat([df1,df2,df3],axis=1)

   PassengerId  ...     Sex
0            1  ...    male
1            2  ...  female
2            3  ...  female
3            4  ...  female
4            5  ...    male

[5 rows x 15 columns]

In [147]:
df4 = pd.concat([df1,df2,df3],axis=0) #row wise concatenation

In [149]:
df4.iloc[0] #iloc for unnamed index

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Name: 0, dtype: object

In [150]:
df4.loc[0]  #loc for named index

   PassengerId  Survived  Pclass                     Name   Sex
0            1         0       3  Braund, Mr. Owen Harris  male
0            1         0       3  Braund, Mr. Owen Harris  male
0            1         0       3  Braund, Mr. Owen Harris  male

In [151]:
#Merging
df1

   PassengerId  ...     Sex
0            1  ...    male
1            2  ...  female
2            3  ...  female
3            4  ...  female
4            5  ...    male

[5 rows x 5 columns]

In [152]:
df2

   PassengerId  ...     Sex
0            1  ...    male
1            2  ...  female
2            3  ...  female
3            4  ...  female
4            5  ...    male

[5 rows x 5 columns]

In [154]:
pd.merge(df1,df2,on='PassengerId') #On same PassengerId

   PassengerId  ...   Sex_y
0            1  ...    male
1            2  ...  female
2            3  ...  female
3            4  ...  female
4            5  ...    male

[5 rows x 9 columns]

In [159]:
#two new dataframe
left = pd.DataFrame({"key":['K0','K8','K2','K3'],
                     'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key':['K1','K1','K2','K3'],
                      'C':['C0','C1','C2','C3'],
                      'D':['D0','D1','D2','D3']})

In [160]:
left

  key   A   B
0  K0  A0  B0
1  K8  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [161]:
right

  key   C   D
0  K1  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [162]:
pd.merge(left,right) #matching keys

  key   A   B   C   D
0  K2  A2  B2  C2  D2
1  K3  A3  B3  C3  D3

In [163]:
pd.merge(left,right,on='key') #inner join on keys

  key   A   B   C   D
0  K2  A2  B2  C2  D2
1  K3  A3  B3  C3  D3

In [164]:
pd.merge(left,right,on='key',how='left') #left join

  key   A   B    C    D
0  K0  A0  B0  NaN  NaN
1  K8  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [165]:
pd.merge(left,right,on='key',how='right') #right join

  key    A    B   C   D
0  K1  NaN  NaN  C0  D0
1  K1  NaN  NaN  C1  D1
2  K2   A2   B2  C2  D2
3  K3   A3   B3  C3  D3

In [167]:
pd.merge(left,right,on='key',how='outer')

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K8   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C0   D0
5  K1  NaN  NaN   C1   D1

In [172]:
#two new dataframe
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3']},
                    index=['a0','a1','a2','a3'])

df2 = pd.DataFrame({'C':['C0','C1','C2','C3'],
                      'D':['D0','D1','D2','D3']},
                     index=['a0','a1','a2','a3'])

In [173]:
#Join operation
#joins based on row indexes
df1.join(df2)

     A   B   C   D
a0  A0  B0  C0  D0
a1  A1  B1  C1  D1
a2  A2  B2  C2  D2
a3  A3  B3  C3  D3

In [175]:
titanic_train= titanic_train.dropna(axis=1)

In [176]:
titanic_train

     PassengerId  Survived  Pclass  ...            Ticket     Fare  new_column
0              1         0       3  ...         A/5 21171   7.2500      vishnu
1              2         1       1  ...          PC 17599  71.2833      vishnu
2              3         1       3  ...  STON/O2. 3101282   7.9250      vishnu
3              4         1       1  ...            113803  53.1000      vishnu
4              5         0       3  ...            373450   8.0500      vishnu
..           ...       ...     ...  ...               ...      ...         ...
886          887         0       2  ...            211536  13.0000      vishnu
887          888         1       1  ...            112053  30.0000      vishnu
888          889         0       3  ...        W./C. 6607  23.4500      vishnu
889          890         1       1  ...            111369  30.0000      vishnu
890          891         0       3  ...            370376   7.7500      vishnu

[891 rows x 10 columns]

In [177]:
titanic_train.head()

   PassengerId  Survived  Pclass  ...            Ticket     Fare  new_column
0            1         0       3  ...         A/5 21171   7.2500      vishnu
1            2         1       1  ...          PC 17599  71.2833      vishnu
2            3         1       3  ...  STON/O2. 3101282   7.9250      vishnu
3            4         1       1  ...            113803  53.1000      vishnu
4            5         0       3  ...            373450   8.0500      vishnu

[5 rows x 10 columns]

In [178]:
#length of the name
titanic_train['len of name'] = titanic_train['Name'].apply(len)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [179]:
#square root of the fair
titanic_train['Sqrt of fair'] = titanic_train['Fare'].apply(lambda x: np.sqrt(x))

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [180]:
titanic_train['Sqrt of fair']

0      2.692582
1      8.442944
2      2.815138
3      7.286975
4      2.837252
         ...
886    3.605551
887    5.477226
888    4.842520
889    5.477226
890    2.783882
Name: Sqrt of fair, Length: 891, dtype: float64

In [181]:
def test(x):
  return np.sqrt(x)

In [183]:
#square root of the fair
titanic_train['Sqrt of fair1'] = titanic_train['Fare'].apply(test)

In [184]:
titanic_train['Sqrt of fair1']

0      2.692582
1      8.442944
2      2.815138
3      7.286975
4      2.837252
         ...
886    3.605551
887    5.477226
888    4.842520
889    5.477226
890    2.783882
Name: Sqrt of fair1, Length: 891, dtype: float64

In [185]:
def test1(x):
  if x=='female':
    return 0
  else:
    return 1

In [186]:
titanic_train['flag'] = titanic_train['Sex'].apply(test1)

In [187]:
titanic_train['flag']

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: flag, Length: 891, dtype: int64

In [190]:
#sort based on fair
titanic_train.sort_values('Fare').head()

     PassengerId  Survived  Pclass  ... Sqrt of fair Sqrt of fair1  flag
271          272         1       3  ...          0.0           0.0     1
597          598         0       3  ...          0.0           0.0     1
302          303         0       3  ...          0.0           0.0     1
633          634         0       1  ...          0.0           0.0     1
277          278         0       2  ...          0.0           0.0     1

[5 rows x 14 columns]